In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
df["Name"] = ["Jacky", "princess"]
df["Age"] = [39, 26]
df["driver"] = [True, False]

In [4]:
df

       Name  Age  driver
0     Jacky   39    True
1  princess   26   False

In [5]:
#creating a row
new_person = pd.Series(["mooney", 34, True], index=["Name", "Age", "driver"])

In [7]:
#append new row
df.append(new_person, ignore_index=True)

C:\Users\UCHIHA MADARA\AppData\Local\Temp\ipykernel_944\354002678.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(new_person, ignore_index=True)

       Name  Age  driver
0     Jacky   39    True
1  princess   26   False
2    mooney   34    True

In [8]:
df.iloc[0]

Name      Jacky
Age          39
driver     True
Name: 0, dtype: object

In [9]:
df.iloc[0:2]

       Name  Age  driver
0     Jacky   39    True
1  princess   26   False